# MMR-DETR architecture YAML for the Road Damage Evaluation Framework.
#
# Based on Ultralytics RT-DETR-l hybrid object detection model.
# MMR-DETR (Multi-scale Multi-head Refinement DETR) extends RT-DETR with
# additional decoder refinement stages for improved prediction quality.
#
# Architecture:
#   - HGNet backbone (P2/4 - P5/32)
#   - Hybrid encoder: AIFI transformer + FPN/PAN neck
#   - RTDETRDecoder with multi-head refinement (8 decoder layers)
#
# Reference: https://github.com/Lrc-1109/MMR-DETR

# Parameters
nc: 5  # number of classes (RDD2022: D00, D10, D20, D30, D40)
scales:
  l: [1.00, 1.00, 1024]  # [depth, width, max_channels]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]  # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 16, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 17, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.0
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # X3 (21), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]  # 22, downsample_convs.0
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # F4 (24), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]  # 25, downsample_convs.1
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # F5 (27), pan_blocks.1

  # RTDETRDecoder(num_classes, ch, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd)
  #   ndl: number of decoder layers (default 6). MMR-DETR uses 8 for extra refinement.
  #   nh:  number of attention heads (default 8).
  #   eval_idx: which layer to use at inference (-1 = last layer).
  # To change decoder params, replace [nc] with positional args e.g.:
  #   [nc, [256,256,256], 256, 300, 100, 8, 8, 1024]
  - [[21, 24, 27], 1, RTDETRDecoder, [nc]]
